DataProcessors/ТелефонныйСправочникHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ТелефонныйСправочникHTML</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПривязкаТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаТелефонов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОсновныеТелефоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеТелефоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СлужебныеSIMКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Привязка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользователиДляРассылки</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтруктурныеЕдиницыФизлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтруктурныеЕдиницыФизлиц</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СлужебныеSIMКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СлужебныеSIMКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезлимитПоРоумингу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляГолосовойСвязи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретСМСУведомлений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользованияSIMКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифыМобильнойСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Картинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КраткоеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнесеныИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеКЗаписи</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоОсновноеИзображение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТелефонныйСправочникHTML/Ext/ObjectModule.bsl
Процедура СформироватьИСохранить() Экспорт
	
	Путь = Константы.ПутьХраненияТелефонногоСправочникаHTML.Получить();
    КаталогНаДиске = Новый Файл(Путь);
    Если КаталогНаДиске.Существует() Тогда
		Если НЕ КаталогНаДиске.ЭтоКаталог() Тогда
			Возврат;
		КонецЕсли;
    Иначе
        Возврат;
    КонецЕсли;
	ИмяФайла = Путь + "\Phonebook.HTML";
	
	ТекстХТМЛ = ПолучитьОтчетХТМЛ();
	
	Если ТекстХТМЛ = "" Тогда
		Возврат;
	КонецЕсли;

	Файл = Новый ТекстовыйДокумент;
	Файл.УстановитьТекст(ТекстХТМЛ);
	Файл.Записать(ИмяФайла, КодировкаТекста.UTF8);
	
КонецПроцедуры

Функция ПолучитьОтчетХТМЛ() Экспорт
	
	ТаблицаОтчета = ПолучитьТаблицуОтчета();
	Если ТаблицаОтчета.Количество()=0 Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстХТМЛ = "<HTML>
		|<HEAD>
		|<META HTTP-EQUIV='Content-Type' CONTENT='text/html; CHARSET=utf-8'>
		|<TITLE>Телефонный справочник</TITLE></HEAD><BODY>
		|<H1>Для поиска нажмите Ctrl-F</H1>
		|";
	ТекстХТМЛ = ТекстХТМЛ + "<TABLE width='100%' border='1' cellspacing='0'>
		|<THEAD align='center'>
		|<TR>
		|<TD><B>Абонент</B></TD>
		|<TD><B>Номер</B></TD>
		|<TD><B>EMail</B></TD>
		|<TD><B>Подразделение</B></TD>
		|<TD><B>Дата увольнения</B></TD>
		|<TD><B>Заблокирован</B></TD>
		|<TD><B>Должность</B></TD>
		|</TR>
		|</THEAD>
		|<TBODY>
		|";
		
	Для каждого Стр Из ТаблицаОтчета Цикл
			
		Номер = "";
		ГрязныйНомер = СокрЛП(Стр.НомерТелефона);
		Для НСим = 1 По СтрДлина(ГрязныйНомер) Цикл
			Сим = Сред(ГрязныйНомер, НСим, 1);
			Если Найти("0123456789", Сим)>0 Тогда
				Номер = Номер + Сим;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрДлина(Номер) = 11 Тогда
			Номер = ?(Лев(Номер, 1)="8", "7", Лев(Номер, 1)) + "(" + Сред(Номер, 2, 3) + ")" + Сред(Номер, 5, 3) + "-" + Прав(Номер, 4); 
		КонецЕсли;
		
		ТекстХТМЛ = ТекстХТМЛ + "<TR>
			|<TD>" + Строка(Стр.Абонент) + "</TD>
			|<TD>" + Номер + "</TD>
			|<TD>" + Строка(Стр.EMail) + "</TD>
			|<TD>" + Строка(Стр.Подразделение) + "</TD>
			|<TD>" + Формат(Стр.ДатаУвольнения, "ДФ=dd.MM.yyyy") + "</TD>
			|<TD>" + Строка(Стр.Заблокирован) + "</TD>
			|<TD>" + Строка(Стр.Должность) + "</TD>
			|</TR>
			|";		
	КонецЦикла;
		
	ТекстХТМЛ = ТекстХТМЛ + "</TBODY></TABLE></BODY></HTML>";
	
	Возврат ТекстХТМЛ;	
	
КонецФункции

Функция ПолучитьТаблицуОтчета()
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	Все.Привязка КАК Объект,
	//			   |	Все.Вид КАК Вид,
	//			   |	Все.Назначение КАК Назначение,
	//			   |	Все.НомерЭлемент,
	//			   |	Все.НомерТелефона КАК НомерТелефона,
	//			   |	Все.Основной КАК Основной,
	//			   |	Все.Абонент КАК Абонент,
	//			   |	ЕСТЬNULL(Мыло.EMail, """") КАК EMail,
	//			   |	ВЫБОР
	//			   |		КОГДА Все.Привязка ССЫЛКА Справочник.СтруктурныеЕдиницы
	//			   |			ТОГДА СтруктурныеЕдиницы.Ссылка
	//			   |		ИНАЧЕ ЕСТЬNULL(Подразделения.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	//			   |	КОНЕЦ КАК Подразделение,
	//			   |	Все.ДатаУвольнения,
	//			   |	ВЫБОР
	//			   |		КОГДА Все.Вид = ""Личный""
	//			   |				ИЛИ Все.Назначение = ЗНАЧЕНИЕ(Справочник.НазначенияИспользованияSIMКарт.СлужебныйТелефон)
	//			   |			ТОГДА ИСТИНА
	//			   |		ИНАЧЕ ЛОЖЬ
	//			   |	КОНЕЦ КАК ГолосоваяСвязь,
	//			   |	Все.Заблокирован,
	//			   |	Все.Должность,
	//			   |	ВЫБОР
	//			   |		КОГДА Все.Привязка = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	//			   |			ТОГДА ""Нет""
	//			   |		ИНАЧЕ ВЫБОР
	//			   |				КОГДА Все.Привязка ССЫЛКА Справочник.ФизическиеЛица
	//			   |					ТОГДА ""ФизЛицо""
	//			   |				ИНАЧЕ ""Подразделение""
	//			   |			КОНЕЦ
	//			   |	КОНЕЦ КАК ВидПривязки
	//			   |ИЗ
	//			   |	(ВЫБРАТЬ
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
	//			   |		""Служебный"" КАК Вид,
	//			   |		ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
	//			   |		ПривязкаТелефоновСрезПоследних.Номер КАК НомерЭлемент,
	//			   |		ПривязкаТелефоновСрезПоследних.Номер.Код КАК НомерТелефона,
	//			   |		ВЫБОР
	//			   |			КОГДА ОсновныеТелефоны.Телефон ЕСТЬ NULL 
	//			   |					И НЕ ВложенныйЗапрос.Номеров = 1
	//			   |				ТОГДА ЛОЖЬ
	//			   |			ИНАЧЕ ИСТИНА
	//			   |		КОНЕЦ КАК Основной,
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка.Наименование КАК Абонент,
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка.ДатаУвольнения КАК ДатаУвольнения,
	//			   |		ЛОЖЬ КАК Заблокирован,
	//			   |		ПривязкаТелефоновСрезПоследних.Привязка.Должность КАК Должность
	//			   |	ИЗ
	//			   |		РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
	//			   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
	//			   |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ОсновныеТелефоны.Привязка
	//			   |				И ПривязкаТелефоновСрезПоследних.Назначение = ОсновныеТелефоны.Назначение
	//			   |				И ПривязкаТелефоновСрезПоследних.Номер = ОсновныеТелефоны.Телефон
	//			   |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |				ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
	//			   |				ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
	//			   |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПривязкаТелефоновСрезПоследних.Номер) КАК Номеров
	//			   |			ИЗ
	//			   |				РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
	//			   |			
	//			   |			СГРУППИРОВАТЬ ПО
	//			   |				ПривязкаТелефоновСрезПоследних.Привязка,
	//			   |				ПривязкаТелефоновСрезПоследних.Назначение) КАК ВложенныйЗапрос
	//			   |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ВложенныйЗапрос.Привязка
	//			   |				И ПривязкаТелефоновСрезПоследних.Назначение = ВложенныйЗапрос.Назначение
	//			   |	
	//			   |	ОБЪЕДИНИТЬ ВСЕ
	//			   |	
	//			   |	ВЫБРАТЬ
	//			   |		КонтактнаяИнформация.Объект,
	//			   |		""Личный"",
	//			   |		"""",
	//			   |		ЗНАЧЕНИЕ(Справочник.СлужебныеSIMКарты.ПустаяСсылка),
	//			   |		ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(25)),
	//			   |		ИСТИНА,
	//			   |		КонтактнаяИнформация.Объект.Наименование,
	//			   |		ДАТАВРЕМЯ(1, 1, 1),
	//			   |		ЛОЖЬ,
	//			   |		КонтактнаяИнформация.Объект.Должность
	//			   |	ИЗ
	//			   |		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//			   |	ГДЕ
	//			   |		КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	//			   |		И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица)) КАК Все
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |			КонтактнаяИнформация.Объект КАК Объект,
	//			   |			ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(50)) КАК EMail
	//			   |		ИЗ
	//			   |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	//			   |		ГДЕ
	//			   |			КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица)) КАК Мыло
	//			   |		ПО Все.Привязка = Мыло.Объект
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			   |			СтруктурныеЕдиницыФизлицСрезПоследних.ФизЛицо КАК ФизЛицо,
	//			   |			СтруктурныеЕдиницыФизлицСрезПоследних.Подразделение КАК Подразделение
	//			   |		ИЗ
	//			   |			РегистрСведений.СтруктурныеЕдиницыФизлиц.СрезПоследних КАК СтруктурныеЕдиницыФизлицСрезПоследних) КАК Подразделения
	//			   |		ПО Все.Привязка = Подразделения.ФизЛицо
	//			   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	//			   |		ПО Все.Привязка = СтруктурныеЕдиницы.Ссылка
	//			   |ГДЕ
	//			   |	Все.Основной
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Подразделение,
	//			   |	Абонент";
	
	Запрос.Текст = "ВЫБРАТЬ
        |	Все.Привязка КАК Объект,
        |	Все.Вид КАК Вид,
        |	Все.Назначение КАК Назначение,
        |	Все.НомерЭлемент,
        |	Все.НомерТелефона КАК НомерТелефона,
        |	Все.Основной КАК Основной,
        |	Все.Абонент КАК Абонент,
        |	ЕСТЬNULL(Мыло.EMail, """") КАК EMail,
        |	ВЫБОР
        |		КОГДА Все.Привязка ССЫЛКА Справочник.СтруктурныеЕдиницы
        |			ТОГДА СтруктурныеЕдиницы.Ссылка
        |		ИНАЧЕ ЕСТЬNULL(Подразделения.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
        |	КОНЕЦ КАК Подразделение,
        |	Все.ДатаУвольнения,
        |	ВЫБОР
        |		КОГДА Все.Вид = ""Личный""
        |				ИЛИ Все.Назначение = ЗНАЧЕНИЕ(Справочник.НазначенияИспользованияSIMКарт.СлужебныйТелефон)
        |			ТОГДА ИСТИНА
        |		ИНАЧЕ ЛОЖЬ
        |	КОНЕЦ КАК ГолосоваяСвязь,
        |	Все.Заблокирован,
        |	Все.Должность,
        |	ВЫБОР
        |		КОГДА Все.Привязка = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
        |			ТОГДА ""Нет""
        |		ИНАЧЕ ВЫБОР
        |				КОГДА Все.Привязка ССЫЛКА Справочник.ФизическиеЛица
        |					ТОГДА ""ФизЛицо""
        |				ИНАЧЕ ""Подразделение""
        |			КОНЕЦ
        |	КОНЕЦ КАК ВидПривязки
        |ИЗ
        |	(ВЫБРАТЬ
        |		ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
        |		""Служебный"" КАК Вид,
        |		ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
        |		ПривязкаТелефоновСрезПоследних.Номер КАК НомерЭлемент,
        |		ПривязкаТелефоновСрезПоследних.Номер.Код КАК НомерТелефона,
        |		ВЫБОР
        |			КОГДА ОсновныеТелефоны.Телефон ЕСТЬ NULL 
        |					И НЕ ВложенныйЗапрос.Номеров = 1
        |				ТОГДА ЛОЖЬ
        |			ИНАЧЕ ИСТИНА
        |		КОНЕЦ КАК Основной,
        |		ПривязкаТелефоновСрезПоследних.Привязка.Наименование КАК Абонент,
        |		ПривязкаТелефоновСрезПоследних.Привязка.ДатаУвольнения КАК ДатаУвольнения,
        |		ЛОЖЬ КАК Заблокирован,
        |		ПривязкаТелефоновСрезПоследних.Привязка.Должность КАК Должность
        |	ИЗ
        |		РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеТелефоны КАК ОсновныеТелефоны
        |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ОсновныеТелефоны.Привязка
        |				И ПривязкаТелефоновСрезПоследних.Назначение = ОсновныеТелефоны.Назначение
        |				И ПривязкаТелефоновСрезПоследних.Номер = ОсновныеТелефоны.Телефон
        |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        |				ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
        |				ПривязкаТелефоновСрезПоследних.Назначение КАК Назначение,
        |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПривязкаТелефоновСрезПоследних.Номер) КАК Номеров
        |			ИЗ
        |				РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних
        |			
        |			СГРУППИРОВАТЬ ПО
        |				ПривязкаТелефоновСрезПоследних.Привязка,
        |				ПривязкаТелефоновСрезПоследних.Назначение) КАК ВложенныйЗапрос
        |			ПО ПривязкаТелефоновСрезПоследних.Привязка = ВложенныйЗапрос.Привязка
        |				И ПривязкаТелефоновСрезПоследних.Назначение = ВложенныйЗапрос.Назначение
        |	
        |	ОБЪЕДИНИТЬ ВСЕ
        |	
        |	ВЫБРАТЬ
        |		КонтактнаяИнформация.Объект,
        |		""Личный"",
        |		"""",
        |		ЗНАЧЕНИЕ(Справочник.СлужебныеSIMКарты.ПустаяСсылка),
        |		ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(25)),
        |		ИСТИНА,
        |		КонтактнаяИнформация.Объект.Наименование,
        |		ДАТАВРЕМЯ(1, 1, 1),
        |		ЛОЖЬ,
        |		КонтактнаяИнформация.Объект.Должность
        |	ИЗ
        |		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
        |	ГДЕ
        |		КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
        |		И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный)
        |		И НЕ КонтактнаяИнформация.Объект В
        |					(ВЫБРАТЬ
        |						ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка
        |					ИЗ
        |						РегистрСведений.ПривязкаТелефонов.СрезПоследних(, НЕ Номер.Заблокирован) КАК ПривязкаТелефоновСрезПоследних)
        |	
        |	ОБЪЕДИНИТЬ ВСЕ
        |	
        |	ВЫБРАТЬ
        |		ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка),
        |		""Служебный"",
        |		"""",
        |		ВложенныйЗапрос.СимКарта,
        |		ВложенныйЗапрос.СимКарта.Код,
        |		ЛОЖЬ,
        |		"""",
        |		ДАТАВРЕМЯ(1, 1, 1),
        |		ВложенныйЗапрос.Заблокирован,
        |		ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
        |	ИЗ
        |		(ВЫБРАТЬ
        |			СлужебныеSIMКарты.Ссылка КАК СимКарта,
        |			ПривязкаТелефоновСрезПоследних.Привязка КАК Привязка,
        |			СлужебныеSIMКарты.Заблокирован КАК Заблокирован
        |		ИЗ
        |			Справочник.СлужебныеSIMКарты КАК СлужебныеSIMКарты
        |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаТелефонов.СрезПоследних КАК ПривязкаТелефоновСрезПоследних
        |				ПО (ПривязкаТелефоновСрезПоследних.Номер = СлужебныеSIMКарты.Ссылка)
        |		ГДЕ
        |			НЕ СлужебныеSIMКарты.ПометкаУдаления) КАК ВложенныйЗапрос
        |	ГДЕ
        |		ВложенныйЗапрос.Привязка ЕСТЬ NULL ) КАК Все
        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        |			КонтактнаяИнформация.Объект КАК Объект,
        |			ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(50)) КАК EMail
        |		ИЗ
        |			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
        |		ГДЕ
        |			КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailФизЛица)) КАК Мыло
        |		ПО Все.Привязка = Мыло.Объект
        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
        |			СтруктурныеЕдиницыФизлицСрезПоследних.ФизЛицо КАК ФизЛицо,
        |			СтруктурныеЕдиницыФизлицСрезПоследних.Подразделение КАК Подразделение
        |		ИЗ
        |			РегистрСведений.СтруктурныеЕдиницыФизлиц.СрезПоследних КАК СтруктурныеЕдиницыФизлицСрезПоследних) КАК Подразделения
        |		ПО Все.Привязка = Подразделения.ФизЛицо
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
        |		ПО Все.Привязка = СтруктурныеЕдиницы.Ссылка
        |ГДЕ
        |	(Все.Привязка = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
        |			ИЛИ Все.Привязка.Активный
        |			ИЛИ НЕ Все.Привязка ССЫЛКА Справочник.ФизическиеЛица)";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
	
КонецФункции
